# -*- coding: utf-8 -*-
from nose.tools import ok_, eq_, with_setup
import rerere


test1 = '''
このメールは受注メールです。
---------------------------------------------------------------------
[受注番号] 200068-20130000-0538897137
[日時]     2013-08-15 18:18:46
[注文者]   あいうえお (アイウエオ) 様
           〒111-2222 東京都渋谷区1-1-1
           (TEL) 111-2222-3333

[支払方法] クレジットカード決済 一括払い
[ポイント利用方法] なし
[配送方法] 宅配便
[備考]
備考欄

[ショップ名]   さわやかショップ
==========
[送付先]   そうふさき (ソウフサキ) 様
           〒999-8888 北海道札幌市1-1-1
           (TEL) 777-555-4444
[商品]
かっこいい商品1
価格  599(円) x 1(個) = 599(円)   (税込、送料込)
獲得ポイント5
----------
かっこいい商品2
価格  1,180(円) x 1(個) = 1,180(円)   (税込、送料込)
獲得ポイント11
----------
かっこいい商品3
価格  12,444(円) x 1(個) = 12,444(円)   (税込、送料込)
獲得ポイント11

*********************************************************************
小計     1,779(円)
消費税   0(円)
送料     0(円)
---------------------------------------------------
合計     1,779(円)
---------------------------------------------------------------------
今回のお買い物で獲得するポイント　16
---------------------------------------------------------------------
その他
'''

test2 = '''
このメールは受注メールです。
---------------------------------------------------------------------
[受注番号] 200068-20130000-0538897137
[日時]     2013-08-15 18:18:46
[注文者]   あいうえお (アイウエオ) 様
           〒111-2222 東京都渋谷区1-1-1
           (TEL) 111-2222-3333

[支払方法] クレジットカード決済 一括払い
[ポイント利用方法] なし
[配送方法] 宅配便
[備考]
備考欄

[ショップ名]   さわやかショップ
==========
[送付先]   そうふさき (ソウフサキ) 様
           〒999-8888 北海道札幌市1-1-1
           (TEL) 777-555-4444
[商品]
かっこいい商品1
価格  599(円) x 1(個) = 599(円)   (税込、送料込)
獲得ポイント5

*********************************************************************
小計     1,779(円)
消費税   0(円)
送料     0(円)
---------------------------------------------------
合計     1,779(円)
---------------------------------------------------------------------
今回のお買い物で獲得するポイント　16
---------------------------------------------------------------------
その他
'''

test11 = '''
---------------------------------------------------------------------
[受注番号] 244394-20131211-0160267226
[日時]     2013-12-11 14:25:00
[注文者]   あああ あああ (アアア アアア) 様
          〒111-2222 東京都渋谷区1-1-1
          (TEL) 111-2222-3333

[支払方法] 銀行振込
[ポイント利用方法] なし
[配送方法] 銀行振込・カード決済・コンビニ決済の場合はこちら（メーカー直送便）
[配送日時指定]


[備考]
銀行振込のお客様へ
★ご注文申し込みのお客様と入金者名義が違う場合はこちらに入金者名義をお書き下さい。
■入金者名義（　　　　　　　　　　）
クッションフロアをご注文のお客様へ
数本に分けて納品をご希望される場合はコチラにご明記下さい。（自動見積もりの商品は不要です）
例）8mを3本、4mを1本
[ショップ名]   さわやかショップ
==========
[送付先]   そうふさき (ソウフサキ) 様
           〒999-8888 北海道札幌市1-1-1
          (TEL) 03-0000-1111
          (のし) のし
[商品]
業務用フラットゴムゴム板1m x 2m x 5mm(厚）(1x2(m)で1枚)
価格  7,980(円) x 3(個) = 23,940(円)   (税込、送料別)
[ラッピング]
(包装紙:テスト)
価格  18(円) x 1(個) = 18(円)   (税込)
[ラッピング]
(リボン:てすと)
価格  20(円) x 1(個) = 20(円)   (税込)
*********************************************************************
小計     23,978(円)
消費税   0(円)
送料     0(円)  離島・一部地域では別途料金が必要な場合があります
---------------------------------------------------
合計     23,978(円)
---------------------------------------------------------------------
＊消費税について
　消費税率　　　　　　5％
　消費税計算順序　　　１商品毎に消費税計算
　１円未満消費税端数　四捨五入
---------------------------------------------------------------------
＊送料等の諸費用は変わる場合があります。
'''


mask1 = '''
\[受注番号\]\s*([0-9-]+)<<=order_no>>
\[日時\]\s*([0-9]{4}\-[0-9]{2}\-[0-9]{2}\s[0-9]{2}:[0-9]{2}:[0-9]{2})<<=insert_date>>
\[注文者\]\s*(\S+)<<=name>> \((\S+)<<=name_kana>>\) 様
\s*〒([0-9]{3}\-[0-9]{4})<<=zip>>\s*(\S+$)<<=address>>
\s*\(TEL\)\s([0-9-]+)<<=phone_number>>

\[商品\]
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント

<<@if match="\-\-\-\-" exit="\*\*\*\*">>
\-\-\-\-\-
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
<<@endif>>

<<@if match="\-\-\-\-" exit="\*\*\*\*">>
\-\-\-\-\-
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
<<@endif>>

<<@if match="\-\-\-\-" exit="\*\*\*\*">>
\-\-\-\-\-
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
<<@endif>>

<<@if match="\-\-\-\-" exit="\*\*\*\*">>
\-\-\-\-\-
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
<<@endif>>

小計\s*([0-9,]+)<<=total_sub>>\(円\)
消費税\s*([0-9]+)<<=tax>>\(円\)
送料\s*([0-9,]+)<<=postage>>\(円\)
\-\-\-\-\-\-
合計\s*([0-9,]+)<<=total>>\(円\)
'''


mask2 = '''
\[受注番号\]\s*([0-9-]+)<<=order_no>>
\[日時\]\s*([0-9]{4}\-[0-9]{2}\-[0-9]{2}\s[0-9]{2}:[0-9]{2}:[0-9]{2})<<=insert_date>>
\[注文者\]\s*(\S+)<<=name>> \((\S+)<<=name_kana>>\) 様
\s*〒([0-9]{3}\-[0-9]{4})<<=zip>>\s*(\S+$)<<=address>>
\s*\(TEL\)\s([0-9-]+)<<=phone_number>>

\[商品\]
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント

<<@loop exit='\*\*\*\*\*'>>
\-\-\-\-\-
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
<<@endloop>>

小計\s*([0-9,]+)<<=total_sub>>\(円\)
消費税\s*([0-9]+)<<=tax>>\(円\)
送料\s*([0-9,]+)<<=postage>>\(円\)
\-\-\-\-\-\-
合計\s*([0-9,]+)<<=total>>\(円\)
'''

mask3 = '''
\[受注番号\]\s*([0-9-]+)<<=order_no>>
\[日時\]\s*([0-9]{4}\-[0-9]{2}\-[0-9]{2}\s[0-9]{2}:[0-9]{2}:[0-9]{2})<<=insert_date>>
\[注文者\]\s*(\S+)<<=name>> \((\S+)<<=name_kana>>\) 様
\s*〒([0-9]{3}\-[0-9]{4})<<=zip>>\s*(\S+$)<<=address>>
\s*\(TEL\)\s([0-9-]+)<<=phone_number>>

\[商品\]
<<@loop exit='\*\*\*\*\*'>>
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
獲得ポイント
\-\-\-\-\-
<<@endloop>>

小計\s*([0-9,]+)<<=total_sub>>\(円\)
消費税\s*([0-9]+)<<=tax>>\(円\)
送料\s*([0-9,]+)<<=postage>>\(円\)
\-\-\-\-\-\-
合計\s*([0-9,]+)<<=total>>\(円\)
'''

mask11 = '''
\[受注番号\]\s*([0-9-]+)<<=order_no>>
\[日時\]\s*([0-9]{4}\-[0-9]{2}\-[0-9]{2}\s[0-9]{2}:[0-9]{2}:[0-9]{2})<<=insert_date>>
\[注文者\]\s*(\S.+)<<=name>> \((\S.+)<<=name_kana>>\) 様
\s*〒([0-9]{3}\-[0-9]{4})<<=zip>>\s*(\S+$)<<=address>>
\s*\(TEL\)\s([0-9-]+)<<=phone_number>>

\[商品\]
<<@loop exit='\*\*\*\*\*'>>
(^.+$)<<=item_name[]>>
価格\s*([0-9,]+)<<=item_price[]>>\(円\) x ([0-9,]+)<<=item_number[]>>\(個\) = ([0-9,]+)<<=item_total[]>>\(円\)
<<@loop exit='\-\-\-\-'>> <<# ***が来れば一個上のloopで脱出できるので---だけを考える>>
ラッピング
(\S+)<<=wrapping_name[]>>
価格\s*([0-9,]+)<<=wrapping_price[]>>\(円\) x ([0-9,]+)<<=wrapping_number[]>>\(個\) = ([0-9,]+)<<=wrapping_total[]>>\(円\)
<<@endloop>>
\-\-\-\-\-
<<@endloop>>

小計\s*([0-9,]+)<<=total_sub>>\(円\)
消費税\s*([0-9]+)<<=tax>>\(円\)
送料\s*([0-9,]+)<<=postage>>\(円\)
\-\-\-\-\-\-
合計\s*([0-9,]+)<<=total>>\(円\)
'''


def setup():
    pass


def teardown():
    pass


def it_1_test():
    ret = rerere.search(mask1, test1)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['item_name'][1], 'かっこいい商品2')
    eq_(ret['item_price'][1], '1,180')
    eq_(ret['item_number'][1], '1')
    eq_(ret['item_total'][1], '1,180')
    eq_(ret['item_name'][2], 'かっこいい商品3')
    eq_(ret['item_price'][2], '12,444')
    eq_(ret['item_number'][2], '1')
    eq_(ret['item_total'][2], '12,444')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_2_test():
    ret = rerere.search(mask2, test1)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['item_name'][1], 'かっこいい商品2')
    eq_(ret['item_price'][1], '1,180')
    eq_(ret['item_number'][1], '1')
    eq_(ret['item_total'][1], '1,180')
    eq_(ret['item_name'][2], 'かっこいい商品3')
    eq_(ret['item_price'][2], '12,444')
    eq_(ret['item_number'][2], '1')
    eq_(ret['item_total'][2], '12,444')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_3_test():
    ret = rerere.search(mask3, test1)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['item_name'][1], 'かっこいい商品2')
    eq_(ret['item_price'][1], '1,180')
    eq_(ret['item_number'][1], '1')
    eq_(ret['item_total'][1], '1,180')
    eq_(ret['item_name'][2], 'かっこいい商品3')
    eq_(ret['item_price'][2], '12,444')
    eq_(ret['item_number'][2], '1')
    eq_(ret['item_total'][2], '12,444')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_4_test():
    ret = rerere.search(mask1, test2)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_5_test():
    ret = rerere.search(mask2, test2)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_6_test():
    ret = rerere.search(mask3, test2)
    eq_(ret['order_no'], '200068-20130000-0538897137')
    eq_(ret['insert_date'], '2013-08-15 18:18:46')
    eq_(ret['name'], 'あいうえお')
    eq_(ret['name_kana'], 'アイウエオ')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], 'かっこいい商品1')
    eq_(ret['item_price'][0], '599')
    eq_(ret['item_number'][0], '1')
    eq_(ret['item_total'][0], '599')
    eq_(ret['total_sub'], '1,779')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '1,779')


def it_11_test():
    ret = rerere.search(mask11, test11)
    eq_(ret['order_no'], '244394-20131211-0160267226')
    eq_(ret['insert_date'], '2013-12-11 14:25:00')
    eq_(ret['name'], 'あああ あああ')
    eq_(ret['name_kana'], 'アアア アアア')
    eq_(ret['zip'], '111-2222')
    eq_(ret['address'], '東京都渋谷区1-1-1')
    eq_(ret['phone_number'], '111-2222-3333')
    eq_(ret['item_name'][0], '業務用フラットゴムゴム板1m x 2m x 5mm(厚）(1x2(m)で1枚)')
    eq_(ret['item_price'][0], '7,980')
    eq_(ret['item_number'][0], '3')
    eq_(ret['item_total'][0], '23,940')
    eq_(ret['wrapping_name'][0], '(包装紙:テスト)')
    eq_(ret['wrapping_name'][1], '(リボン:てすと)')
    eq_(ret['wrapping_number'][0], '1')
    eq_(ret['wrapping_number'][1], '1')
    eq_(ret['wrapping_price'][0], '18')
    eq_(ret['wrapping_price'][1], '20')
    eq_(ret['wrapping_total'][0], '18')
    eq_(ret['wrapping_total'][1], '20')
    eq_(ret['total_sub'], '23,978')
    eq_(ret['tax'], '0')
    eq_(ret['postage'], '0')
    eq_(ret['total'], '23,978')
   
